//problem No. ,
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
#include <iostream>
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
using namespace std;
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//cleaning 2
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222

//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
int main()
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
{
	//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
	//왜 자꾸 꼬이는거냐 진짜 짜증나네
}
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222
//왜 자꾸 꼬이는거냐 진짜 짜증나네 2222